/*
S1.12. Составить программу вывода на экран следующей информации:
5 10
7 см
 */


using System;

namespace S1._12_
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("5 10\n7 см");
        }
    }
}
