/*
S1.13. Составить программу вывода на экран следующей информации:
2 кг
13 17
 */


namespace S1._13_
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("2 кг\n13 17");
        }
    }
}
